analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/ptg_regs.h
#define MXC_F_PTG_RESYNC_PT15_POS                      15 /**< RESYNC_PT15 Position */
#define MXC_F_PTG_RESYNC_PT15                          ((uint32_t)(0x1UL << MXC_F_PTG_RESYNC_PT15_POS)) /**< RESYNC_PT15 Mask */

/**@} end of group PTG_RESYNC_Register */

/**
 * @ingroup  ptg_registers
 * @defgroup PTG_STOP_INTFL PTG_STOP_INTFL
 * @brief    Pulse Train Interrupt Flags
 * @{
 */
#define MXC_F_PTG_STOP_INTFL_PT0_POS                   0 /**< STOP_INTFL_PT0 Position */
#define MXC_F_PTG_STOP_INTFL_PT0                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT0_POS)) /**< STOP_INTFL_PT0 Mask */

#define MXC_F_PTG_STOP_INTFL_PT1_POS                   1 /**< STOP_INTFL_PT1 Position */
#define MXC_F_PTG_STOP_INTFL_PT1                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT1_POS)) /**< STOP_INTFL_PT1 Mask */

#define MXC_F_PTG_STOP_INTFL_PT2_POS                   2 /**< STOP_INTFL_PT2 Position */
#define MXC_F_PTG_STOP_INTFL_PT2                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT2_POS)) /**< STOP_INTFL_PT2 Mask */

#define MXC_F_PTG_STOP_INTFL_PT3_POS                   3 /**< STOP_INTFL_PT3 Position */
#define MXC_F_PTG_STOP_INTFL_PT3                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT3_POS)) /**< STOP_INTFL_PT3 Mask */

#define MXC_F_PTG_STOP_INTFL_PT4_POS                   4 /**< STOP_INTFL_PT4 Position */
#define MXC_F_PTG_STOP_INTFL_PT4                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT4_POS)) /**< STOP_INTFL_PT4 Mask */

#define MXC_F_PTG_STOP_INTFL_PT5_POS                   5 /**< STOP_INTFL_PT5 Position */
#define MXC_F_PTG_STOP_INTFL_PT5                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT5_POS)) /**< STOP_INTFL_PT5 Mask */

#define MXC_F_PTG_STOP_INTFL_PT6_POS                   6 /**< STOP_INTFL_PT6 Position */
#define MXC_F_PTG_STOP_INTFL_PT6                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT6_POS)) /**< STOP_INTFL_PT6 Mask */

#define MXC_F_PTG_STOP_INTFL_PT7_POS                   7 /**< STOP_INTFL_PT7 Position */
#define MXC_F_PTG_STOP_INTFL_PT7                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT7_POS)) /**< STOP_INTFL_PT7 Mask */

#define MXC_F_PTG_STOP_INTFL_PT8_POS                   8 /**< STOP_INTFL_PT8 Position */
#define MXC_F_PTG_STOP_INTFL_PT8                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT8_POS)) /**< STOP_INTFL_PT8 Mask */

#define MXC_F_PTG_STOP_INTFL_PT9_POS                   9 /**< STOP_INTFL_PT9 Position */
#define MXC_F_PTG_STOP_INTFL_PT9                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT9_POS)) /**< STOP_INTFL_PT9 Mask */

#define MXC_F_PTG_STOP_INTFL_PT10_POS                  10 /**< STOP_INTFL_PT10 Position */
#define MXC_F_PTG_STOP_INTFL_PT10                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT10_POS)) /**< STOP_INTFL_PT10 Mask */

#define MXC_F_PTG_STOP_INTFL_PT11_POS                  11 /**< STOP_INTFL_PT11 Position */
#define MXC_F_PTG_STOP_INTFL_PT11                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT11_POS)) /**< STOP_INTFL_PT11 Mask */

#define MXC_F_PTG_STOP_INTFL_PT12_POS                  12 /**< STOP_INTFL_PT12 Position */
#define MXC_F_PTG_STOP_INTFL_PT12                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT12_POS)) /**< STOP_INTFL_PT12 Mask */

#define MXC_F_PTG_STOP_INTFL_PT13_POS                  13 /**< STOP_INTFL_PT13 Position */
#define MXC_F_PTG_STOP_INTFL_PT13                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT13_POS)) /**< STOP_INTFL_PT13 Mask */

#define MXC_F_PTG_STOP_INTFL_PT14_POS                  14 /**< STOP_INTFL_PT14 Position */
#define MXC_F_PTG_STOP_INTFL_PT14                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT14_POS)) /**< STOP_INTFL_PT14 Mask */

#define MXC_F_PTG_STOP_INTFL_PT15_POS                  15 /**< STOP_INTFL_PT15 Position */
#define MXC_F_PTG_STOP_INTFL_PT15                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTFL_PT15_POS)) /**< STOP_INTFL_PT15 Mask */

/**@} end of group PTG_STOP_INTFL_Register */

/**
 * @ingroup  ptg_registers
 * @defgroup PTG_STOP_INTEN PTG_STOP_INTEN
 * @brief    Pulse Train Interrupt Enable/Disable
 * @{
 */
#define MXC_F_PTG_STOP_INTEN_PT0_POS                   0 /**< STOP_INTEN_PT0 Position */
#define MXC_F_PTG_STOP_INTEN_PT0                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT0_POS)) /**< STOP_INTEN_PT0 Mask */

#define MXC_F_PTG_STOP_INTEN_PT1_POS                   1 /**< STOP_INTEN_PT1 Position */
#define MXC_F_PTG_STOP_INTEN_PT1                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT1_POS)) /**< STOP_INTEN_PT1 Mask */

#define MXC_F_PTG_STOP_INTEN_PT2_POS                   2 /**< STOP_INTEN_PT2 Position */
#define MXC_F_PTG_STOP_INTEN_PT2                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT2_POS)) /**< STOP_INTEN_PT2 Mask */

#define MXC_F_PTG_STOP_INTEN_PT3_POS                   3 /**< STOP_INTEN_PT3 Position */
#define MXC_F_PTG_STOP_INTEN_PT3                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT3_POS)) /**< STOP_INTEN_PT3 Mask */

#define MXC_F_PTG_STOP_INTEN_PT4_POS                   4 /**< STOP_INTEN_PT4 Position */
#define MXC_F_PTG_STOP_INTEN_PT4                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT4_POS)) /**< STOP_INTEN_PT4 Mask */

#define MXC_F_PTG_STOP_INTEN_PT5_POS                   5 /**< STOP_INTEN_PT5 Position */
#define MXC_F_PTG_STOP_INTEN_PT5                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT5_POS)) /**< STOP_INTEN_PT5 Mask */

#define MXC_F_PTG_STOP_INTEN_PT6_POS                   6 /**< STOP_INTEN_PT6 Position */
#define MXC_F_PTG_STOP_INTEN_PT6                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT6_POS)) /**< STOP_INTEN_PT6 Mask */

#define MXC_F_PTG_STOP_INTEN_PT7_POS                   7 /**< STOP_INTEN_PT7 Position */
#define MXC_F_PTG_STOP_INTEN_PT7                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT7_POS)) /**< STOP_INTEN_PT7 Mask */

#define MXC_F_PTG_STOP_INTEN_PT8_POS                   8 /**< STOP_INTEN_PT8 Position */
#define MXC_F_PTG_STOP_INTEN_PT8                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT8_POS)) /**< STOP_INTEN_PT8 Mask */

#define MXC_F_PTG_STOP_INTEN_PT9_POS                   9 /**< STOP_INTEN_PT9 Position */
#define MXC_F_PTG_STOP_INTEN_PT9                       ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT9_POS)) /**< STOP_INTEN_PT9 Mask */

