analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/ptg_regs.h
#define MXC_F_PTG_STOP_INTEN_PT10_POS                  10 /**< STOP_INTEN_PT10 Position */
#define MXC_F_PTG_STOP_INTEN_PT10                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT10_POS)) /**< STOP_INTEN_PT10 Mask */

#define MXC_F_PTG_STOP_INTEN_PT11_POS                  11 /**< STOP_INTEN_PT11 Position */
#define MXC_F_PTG_STOP_INTEN_PT11                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT11_POS)) /**< STOP_INTEN_PT11 Mask */

#define MXC_F_PTG_STOP_INTEN_PT12_POS                  12 /**< STOP_INTEN_PT12 Position */
#define MXC_F_PTG_STOP_INTEN_PT12                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT12_POS)) /**< STOP_INTEN_PT12 Mask */

#define MXC_F_PTG_STOP_INTEN_PT13_POS                  13 /**< STOP_INTEN_PT13 Position */
#define MXC_F_PTG_STOP_INTEN_PT13                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT13_POS)) /**< STOP_INTEN_PT13 Mask */

#define MXC_F_PTG_STOP_INTEN_PT14_POS                  14 /**< STOP_INTEN_PT14 Position */
#define MXC_F_PTG_STOP_INTEN_PT14                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT14_POS)) /**< STOP_INTEN_PT14 Mask */

#define MXC_F_PTG_STOP_INTEN_PT15_POS                  15 /**< STOP_INTEN_PT15 Position */
#define MXC_F_PTG_STOP_INTEN_PT15                      ((uint32_t)(0x1UL << MXC_F_PTG_STOP_INTEN_PT15_POS)) /**< STOP_INTEN_PT15 Mask */

/**@} end of group PTG_STOP_INTEN_Register */

/**
 * @ingroup  ptg_registers
 * @defgroup PTG_SAFE_EN PTG_SAFE_EN
 * @brief    Pulse Train Global Safe Enable.
 * @{
 */
#define MXC_F_PTG_SAFE_EN_PT0_POS                      0 /**< SAFE_EN_PT0 Position */
#define MXC_F_PTG_SAFE_EN_PT0                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT0_POS)) /**< SAFE_EN_PT0 Mask */

#define MXC_F_PTG_SAFE_EN_PT1_POS                      1 /**< SAFE_EN_PT1 Position */
#define MXC_F_PTG_SAFE_EN_PT1                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT1_POS)) /**< SAFE_EN_PT1 Mask */

#define MXC_F_PTG_SAFE_EN_PT2_POS                      2 /**< SAFE_EN_PT2 Position */
#define MXC_F_PTG_SAFE_EN_PT2                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT2_POS)) /**< SAFE_EN_PT2 Mask */

#define MXC_F_PTG_SAFE_EN_PT3_POS                      3 /**< SAFE_EN_PT3 Position */
#define MXC_F_PTG_SAFE_EN_PT3                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT3_POS)) /**< SAFE_EN_PT3 Mask */

#define MXC_F_PTG_SAFE_EN_PT4_POS                      4 /**< SAFE_EN_PT4 Position */
#define MXC_F_PTG_SAFE_EN_PT4                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT4_POS)) /**< SAFE_EN_PT4 Mask */

#define MXC_F_PTG_SAFE_EN_PT5_POS                      5 /**< SAFE_EN_PT5 Position */
#define MXC_F_PTG_SAFE_EN_PT5                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT5_POS)) /**< SAFE_EN_PT5 Mask */

#define MXC_F_PTG_SAFE_EN_PT6_POS                      6 /**< SAFE_EN_PT6 Position */
#define MXC_F_PTG_SAFE_EN_PT6                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT6_POS)) /**< SAFE_EN_PT6 Mask */

#define MXC_F_PTG_SAFE_EN_PT7_POS                      7 /**< SAFE_EN_PT7 Position */
#define MXC_F_PTG_SAFE_EN_PT7                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT7_POS)) /**< SAFE_EN_PT7 Mask */

#define MXC_F_PTG_SAFE_EN_PT8_POS                      8 /**< SAFE_EN_PT8 Position */
#define MXC_F_PTG_SAFE_EN_PT8                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT8_POS)) /**< SAFE_EN_PT8 Mask */

#define MXC_F_PTG_SAFE_EN_PT9_POS                      9 /**< SAFE_EN_PT9 Position */
#define MXC_F_PTG_SAFE_EN_PT9                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT9_POS)) /**< SAFE_EN_PT9 Mask */

#define MXC_F_PTG_SAFE_EN_PT10_POS                     10 /**< SAFE_EN_PT10 Position */
#define MXC_F_PTG_SAFE_EN_PT10                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT10_POS)) /**< SAFE_EN_PT10 Mask */

#define MXC_F_PTG_SAFE_EN_PT11_POS                     11 /**< SAFE_EN_PT11 Position */
#define MXC_F_PTG_SAFE_EN_PT11                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT11_POS)) /**< SAFE_EN_PT11 Mask */

#define MXC_F_PTG_SAFE_EN_PT12_POS                     12 /**< SAFE_EN_PT12 Position */
#define MXC_F_PTG_SAFE_EN_PT12                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT12_POS)) /**< SAFE_EN_PT12 Mask */

#define MXC_F_PTG_SAFE_EN_PT13_POS                     13 /**< SAFE_EN_PT13 Position */
#define MXC_F_PTG_SAFE_EN_PT13                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT13_POS)) /**< SAFE_EN_PT13 Mask */

#define MXC_F_PTG_SAFE_EN_PT14_POS                     14 /**< SAFE_EN_PT14 Position */
#define MXC_F_PTG_SAFE_EN_PT14                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT14_POS)) /**< SAFE_EN_PT14 Mask */

#define MXC_F_PTG_SAFE_EN_PT15_POS                     15 /**< SAFE_EN_PT15 Position */
#define MXC_F_PTG_SAFE_EN_PT15                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT15_POS)) /**< SAFE_EN_PT15 Mask */

/**@} end of group PTG_SAFE_EN_Register */

/**
 * @ingroup  ptg_registers
 * @defgroup PTG_SAFE_DIS PTG_SAFE_DIS
 * @brief    Pulse Train Global Safe Disable.
 * @{
 */
#define MXC_F_PTG_SAFE_DIS_PT0_POS                     0 /**< SAFE_DIS_PT0 Position */
#define MXC_F_PTG_SAFE_DIS_PT0                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT0_POS)) /**< SAFE_DIS_PT0 Mask */

#define MXC_F_PTG_SAFE_DIS_PT1_POS                     1 /**< SAFE_DIS_PT1 Position */
#define MXC_F_PTG_SAFE_DIS_PT1                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT1_POS)) /**< SAFE_DIS_PT1 Mask */

#define MXC_F_PTG_SAFE_DIS_PT2_POS                     2 /**< SAFE_DIS_PT2 Position */
#define MXC_F_PTG_SAFE_DIS_PT2                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT2_POS)) /**< SAFE_DIS_PT2 Mask */

#define MXC_F_PTG_SAFE_DIS_PT3_POS                     3 /**< SAFE_DIS_PT3 Position */
#define MXC_F_PTG_SAFE_DIS_PT3                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT3_POS)) /**< SAFE_DIS_PT3 Mask */

#define MXC_F_PTG_SAFE_DIS_PT4_POS                     4 /**< SAFE_DIS_PT4 Position */
#define MXC_F_PTG_SAFE_DIS_PT4                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT4_POS)) /**< SAFE_DIS_PT4 Mask */

#define MXC_F_PTG_SAFE_DIS_PT5_POS                     5 /**< SAFE_DIS_PT5 Position */
#define MXC_F_PTG_SAFE_DIS_PT5                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT5_POS)) /**< SAFE_DIS_PT5 Mask */

