analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/ptg_regs.h
#define MXC_F_PTG_SAFE_DIS_PT6_POS                     6 /**< SAFE_DIS_PT6 Position */
#define MXC_F_PTG_SAFE_DIS_PT6                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT6_POS)) /**< SAFE_DIS_PT6 Mask */

#define MXC_F_PTG_SAFE_DIS_PT7_POS                     7 /**< SAFE_DIS_PT7 Position */
#define MXC_F_PTG_SAFE_DIS_PT7                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT7_POS)) /**< SAFE_DIS_PT7 Mask */

#define MXC_F_PTG_SAFE_DIS_PT8_POS                     8 /**< SAFE_DIS_PT8 Position */
#define MXC_F_PTG_SAFE_DIS_PT8                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT8_POS)) /**< SAFE_DIS_PT8 Mask */

#define MXC_F_PTG_SAFE_DIS_PT9_POS                     9 /**< SAFE_DIS_PT9 Position */
#define MXC_F_PTG_SAFE_DIS_PT9                         ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT9_POS)) /**< SAFE_DIS_PT9 Mask */

#define MXC_F_PTG_SAFE_DIS_PT10_POS                    10 /**< SAFE_DIS_PT10 Position */
#define MXC_F_PTG_SAFE_DIS_PT10                        ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT10_POS)) /**< SAFE_DIS_PT10 Mask */

#define MXC_F_PTG_SAFE_DIS_PT11_POS                    11 /**< SAFE_DIS_PT11 Position */
#define MXC_F_PTG_SAFE_DIS_PT11                        ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT11_POS)) /**< SAFE_DIS_PT11 Mask */

#define MXC_F_PTG_SAFE_DIS_PT12_POS                    12 /**< SAFE_DIS_PT12 Position */
#define MXC_F_PTG_SAFE_DIS_PT12                        ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT12_POS)) /**< SAFE_DIS_PT12 Mask */

#define MXC_F_PTG_SAFE_DIS_PT13_POS                    13 /**< SAFE_DIS_PT13 Position */
#define MXC_F_PTG_SAFE_DIS_PT13                        ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT13_POS)) /**< SAFE_DIS_PT13 Mask */

#define MXC_F_PTG_SAFE_DIS_PT14_POS                    14 /**< SAFE_DIS_PT14 Position */
#define MXC_F_PTG_SAFE_DIS_PT14                        ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT14_POS)) /**< SAFE_DIS_PT14 Mask */

#define MXC_F_PTG_SAFE_DIS_PT15_POS                    15 /**< SAFE_DIS_PT15 Position */
#define MXC_F_PTG_SAFE_DIS_PT15                        ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_DIS_PT15_POS)) /**< SAFE_DIS_PT15 Mask */

/**@} end of group PTG_SAFE_DIS_Register */

/**
 * @ingroup  ptg_registers
 * @defgroup PTG_READY_INTFL PTG_READY_INTFL
 * @brief    Pulse Train Ready Interrupt Flags
 * @{
 */
#define MXC_F_PTG_READY_INTFL_PT0_POS                  0 /**< READY_INTFL_PT0 Position */
#define MXC_F_PTG_READY_INTFL_PT0                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT0_POS)) /**< READY_INTFL_PT0 Mask */

#define MXC_F_PTG_READY_INTFL_PT1_POS                  1 /**< READY_INTFL_PT1 Position */
#define MXC_F_PTG_READY_INTFL_PT1                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT1_POS)) /**< READY_INTFL_PT1 Mask */

#define MXC_F_PTG_READY_INTFL_PT2_POS                  2 /**< READY_INTFL_PT2 Position */
#define MXC_F_PTG_READY_INTFL_PT2                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT2_POS)) /**< READY_INTFL_PT2 Mask */

#define MXC_F_PTG_READY_INTFL_PT3_POS                  3 /**< READY_INTFL_PT3 Position */
#define MXC_F_PTG_READY_INTFL_PT3                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT3_POS)) /**< READY_INTFL_PT3 Mask */

#define MXC_F_PTG_READY_INTFL_PT4_POS                  4 /**< READY_INTFL_PT4 Position */
#define MXC_F_PTG_READY_INTFL_PT4                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT4_POS)) /**< READY_INTFL_PT4 Mask */

#define MXC_F_PTG_READY_INTFL_PT5_POS                  5 /**< READY_INTFL_PT5 Position */
#define MXC_F_PTG_READY_INTFL_PT5                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT5_POS)) /**< READY_INTFL_PT5 Mask */

#define MXC_F_PTG_READY_INTFL_PT6_POS                  6 /**< READY_INTFL_PT6 Position */
#define MXC_F_PTG_READY_INTFL_PT6                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT6_POS)) /**< READY_INTFL_PT6 Mask */

#define MXC_F_PTG_READY_INTFL_PT7_POS                  7 /**< READY_INTFL_PT7 Position */
#define MXC_F_PTG_READY_INTFL_PT7                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT7_POS)) /**< READY_INTFL_PT7 Mask */

#define MXC_F_PTG_READY_INTFL_PT8_POS                  8 /**< READY_INTFL_PT8 Position */
#define MXC_F_PTG_READY_INTFL_PT8                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT8_POS)) /**< READY_INTFL_PT8 Mask */

#define MXC_F_PTG_READY_INTFL_PT9_POS                  9 /**< READY_INTFL_PT9 Position */
#define MXC_F_PTG_READY_INTFL_PT9                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT9_POS)) /**< READY_INTFL_PT9 Mask */

#define MXC_F_PTG_READY_INTFL_PT10_POS                 10 /**< READY_INTFL_PT10 Position */
#define MXC_F_PTG_READY_INTFL_PT10                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT10_POS)) /**< READY_INTFL_PT10 Mask */

#define MXC_F_PTG_READY_INTFL_PT11_POS                 11 /**< READY_INTFL_PT11 Position */
#define MXC_F_PTG_READY_INTFL_PT11                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT11_POS)) /**< READY_INTFL_PT11 Mask */

#define MXC_F_PTG_READY_INTFL_PT12_POS                 12 /**< READY_INTFL_PT12 Position */
#define MXC_F_PTG_READY_INTFL_PT12                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT12_POS)) /**< READY_INTFL_PT12 Mask */

#define MXC_F_PTG_READY_INTFL_PT13_POS                 13 /**< READY_INTFL_PT13 Position */
#define MXC_F_PTG_READY_INTFL_PT13                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT13_POS)) /**< READY_INTFL_PT13 Mask */

#define MXC_F_PTG_READY_INTFL_PT14_POS                 14 /**< READY_INTFL_PT14 Position */
#define MXC_F_PTG_READY_INTFL_PT14                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT14_POS)) /**< READY_INTFL_PT14 Mask */

#define MXC_F_PTG_READY_INTFL_PT15_POS                 15 /**< READY_INTFL_PT15 Position */
#define MXC_F_PTG_READY_INTFL_PT15                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTFL_PT15_POS)) /**< READY_INTFL_PT15 Mask */

