analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/ptg_regs.h
/**@} end of group PTG_READY_INTFL_Register */

/**
 * @ingroup  ptg_registers
 * @defgroup PTG_READY_INTEN PTG_READY_INTEN
 * @brief    Pulse Train Ready Interrupt Enable/Disable
 * @{
 */
#define MXC_F_PTG_READY_INTEN_PT0_POS                  0 /**< READY_INTEN_PT0 Position */
#define MXC_F_PTG_READY_INTEN_PT0                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT0_POS)) /**< READY_INTEN_PT0 Mask */

#define MXC_F_PTG_READY_INTEN_PT1_POS                  1 /**< READY_INTEN_PT1 Position */
#define MXC_F_PTG_READY_INTEN_PT1                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT1_POS)) /**< READY_INTEN_PT1 Mask */

#define MXC_F_PTG_READY_INTEN_PT2_POS                  2 /**< READY_INTEN_PT2 Position */
#define MXC_F_PTG_READY_INTEN_PT2                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT2_POS)) /**< READY_INTEN_PT2 Mask */

#define MXC_F_PTG_READY_INTEN_PT3_POS                  3 /**< READY_INTEN_PT3 Position */
#define MXC_F_PTG_READY_INTEN_PT3                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT3_POS)) /**< READY_INTEN_PT3 Mask */

#define MXC_F_PTG_READY_INTEN_PT4_POS                  4 /**< READY_INTEN_PT4 Position */
#define MXC_F_PTG_READY_INTEN_PT4                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT4_POS)) /**< READY_INTEN_PT4 Mask */

#define MXC_F_PTG_READY_INTEN_PT5_POS                  5 /**< READY_INTEN_PT5 Position */
#define MXC_F_PTG_READY_INTEN_PT5                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT5_POS)) /**< READY_INTEN_PT5 Mask */

#define MXC_F_PTG_READY_INTEN_PT6_POS                  6 /**< READY_INTEN_PT6 Position */
#define MXC_F_PTG_READY_INTEN_PT6                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT6_POS)) /**< READY_INTEN_PT6 Mask */

#define MXC_F_PTG_READY_INTEN_PT7_POS                  7 /**< READY_INTEN_PT7 Position */
#define MXC_F_PTG_READY_INTEN_PT7                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT7_POS)) /**< READY_INTEN_PT7 Mask */

#define MXC_F_PTG_READY_INTEN_PT8_POS                  8 /**< READY_INTEN_PT8 Position */
#define MXC_F_PTG_READY_INTEN_PT8                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT8_POS)) /**< READY_INTEN_PT8 Mask */

#define MXC_F_PTG_READY_INTEN_PT9_POS                  9 /**< READY_INTEN_PT9 Position */
#define MXC_F_PTG_READY_INTEN_PT9                      ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT9_POS)) /**< READY_INTEN_PT9 Mask */

#define MXC_F_PTG_READY_INTEN_PT10_POS                 10 /**< READY_INTEN_PT10 Position */
#define MXC_F_PTG_READY_INTEN_PT10                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT10_POS)) /**< READY_INTEN_PT10 Mask */

#define MXC_F_PTG_READY_INTEN_PT11_POS                 11 /**< READY_INTEN_PT11 Position */
#define MXC_F_PTG_READY_INTEN_PT11                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT11_POS)) /**< READY_INTEN_PT11 Mask */

#define MXC_F_PTG_READY_INTEN_PT12_POS                 12 /**< READY_INTEN_PT12 Position */
#define MXC_F_PTG_READY_INTEN_PT12                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT12_POS)) /**< READY_INTEN_PT12 Mask */

#define MXC_F_PTG_READY_INTEN_PT13_POS                 13 /**< READY_INTEN_PT13 Position */
#define MXC_F_PTG_READY_INTEN_PT13                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT13_POS)) /**< READY_INTEN_PT13 Mask */

#define MXC_F_PTG_READY_INTEN_PT14_POS                 14 /**< READY_INTEN_PT14 Position */
#define MXC_F_PTG_READY_INTEN_PT14                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT14_POS)) /**< READY_INTEN_PT14 Mask */

#define MXC_F_PTG_READY_INTEN_PT15_POS                 15 /**< READY_INTEN_PT15 Position */
#define MXC_F_PTG_READY_INTEN_PT15                     ((uint32_t)(0x1UL << MXC_F_PTG_READY_INTEN_PT15_POS)) /**< READY_INTEN_PT15 Mask */

/**@} end of group PTG_READY_INTEN_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32690_INCLUDE_PTG_REGS_H_
